toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._SDTask")]]
    static inline uint8_t Stack[256];
};

struct _ImgTask {
    static void Init() {
        Wait();
        _Scheduler::Start<_ImgTask>([] { _Init(); });
    }
    
    static void Capture(const Img::Id& id) {
        Wait();
        
        static struct { Img::Id id; } Args;
        Args = { id };
        _Scheduler::Start<_ImgTask>([] { _Capture(Args.id); });
    }
    
    static uint8_t CaptureBlock() {
        Wait();
        return _CaptureBlock;
    }
    
    static void Wait() {
        _Scheduler::Wait<_ImgTask>();
    }
    
    static void _Init() {
        // Initialize image sensor
        _ImgSensor::Init();
        // Set the initial exposure _before_ we enable streaming, so that the very first frame
        // has the correct exposure, so we don't have to skip any frames on the first capture.
        _ImgSensor::SetCoarseIntTime(_AutoExp.integrationTime());
        // Enable image streaming
        _ImgSensor::SetStreamEnabled(true);
    }
    
    static void _Capture(const Img::Id& id) {
        // Try up to `CaptureAttemptCount` times to capture a properly-exposed image
        constexpr uint8_t CaptureAttemptCount = 3;
        uint8_t bestExpBlock = 0;
        uint8_t bestExpScore = 0;
        for (uint8_t i=0; i<CaptureAttemptCount; i++) {
            // skipCount:
            // On the initial capture, we didn't set the exposure, so we don't need to skip any images.
            // On subsequent captures, we did set the exposure before the capture, so we need to skip a single
            // image since the first image after setting the exposure is invalid.
            const uint8_t skipCount = (!i ? 0 : 1);
            
            // expBlock: Store images in the block belonging to the worst-exposed image captured so far
            const uint8_t expBlock = !bestExpBlock;
            
            // Populate the header
            static Img::Header header = {
                .magic          = Img::Header::MagicNumber,
                .version        = Img::Header::Version,
                .imageWidth     = Img::Full::PixelWidth,
                .imageHeight    = Img::Full::PixelHeight,
                .coarseIntTime  = 0,
                .analogGain     = 0,
                .id             = 0,
                .timestamp      = 0,
            };
            
            header.coarseIntTime = _AutoExp.integrationTime();
            header.id = id;
            header.timestamp = _RTC.time();
            
            // Capture an image to RAM
            const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
            const uint8_t expScore = _AutoExp.update(resp.highlightCount(), resp.shadowCount());
            if (!bestExpScore || (expScore > bestExpScore)) {
                bestExpBlock = expBlock;
                bestExpScore = expScore;
            }
            
            // We're done if we don't have any exposure changes
            if (!_AutoExp.changed()) break;
            
            // Update the exposure
            _ImgSensor::SetCoarseIntTime(_AutoExp.integrationTime());
        }
        
        _CaptureBlock = bestExpBlock;
    }
    
    static inline uint8_t _CaptureBlock = 0;
    
    // _AutoExp: auto exposure algorithm object
    // Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    // This is so we don't forget exposure levels between captures,
    // since the exposure doesn't change often.
    [[gnu::section(".ram_backup.main")]]
    static inline Img::AutoExposure _AutoExp;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._ImgTask")]]
    static inline uint8_t Stack[256];
};

struct _MainTask {
    static void Run() {
        
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(250));
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//        }
        
//        _WaitingForMotion = true;
//        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(10000));
//        }
        
        const MSP::ImgRingBuf& imgRingBuf = _State.sd.imgRingBufs[0];
        
//        for (int i=0; i<2; i++)
        for (;;)
        {
            _Scheduler::Sleep(_Scheduler::Ms(100));
            
            // Turn on VDD_B power (turns on ICE40)
            _VDDBSetEnabled(true);
            
            #warning TODO: this delay is needed for the ICE40 to start, but we need to speed it up, see Notes.txt
            _Scheduler::Sleep(_Scheduler::Ms(250));
            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
            
            // Reset SDController before we turn on power
            _SDTask::Reset();
            _SDTask::Wait();
            
            // Perform LVS sequence
            _SDTask::LVSSequence();
            _SDTask::Wait();
            
            // Turn on IMG/SD power
            _VDDIMGSDSetEnabled(true);
            _Scheduler::Sleep(_Scheduler::Ms(1000));
            
//            // Perform LVS sequence
//            _SDTask::LVSSequence();
//            _SDTask::Wait();
            
            _Scheduler::Sleep(_Scheduler::Ms(1000));
            _SDTask::Init();
            _SDTask::Wait();
            
            // Capture image to RAM
            _ImgTask::Init();
            _ImgTask::Capture(imgRingBuf.buf.idEnd);
            const uint8_t srcRAMBlock = _ImgTask::CaptureBlock();
            
            // Copy image from RAM -> SD card
            _SDTask::Write(srcRAMBlock);
            _SDTask::Wait();
            
            _Scheduler::Sleep(_Scheduler::Ms(1000));
            
            // Reset SDController before we turn off power
            _SDTask::Reset();
            _SDTask::Wait();
            
            _VDDIMGSDSetEnabled(false);
            
